import pc from 'picocolors'

//  Generated with: https://patorjk.com/software/taag/#p=display&f=ANSI%20Shadow&t=INIT%20MY%0AREPO
const LINE1 = [
  '  ██╗███╗   ██╗██╗████████╗    ███╗   ███╗██╗   ██╗',
  '  ██║████╗  ██║██║╚══██╔══╝    ████╗ ████║╚██╗ ██╔╝',
  '  ██║██╔██╗ ██║██║   ██║       ██╔████╔██║ ╚████╔╝ ',
  '  ██║██║╚██╗██║██║   ██║       ██║╚██╔╝██║  ╚██╔╝  ',
  '  ██║██║ ╚████║██║   ██║       ██║ ╚═╝ ██║   ██║   ',
  '  ╚═╝╚═╝  ╚═══╝╚═╝   ╚═╝       ╚═╝     ╚═╝   ╚═╝   ',
]

const LINE2 = [
  '  ██████╗ ███████╗██████╗  ██████╗ ',
  '  ██╔══██╗██╔════╝██╔══██╗██╔═══██╗',
  '  ██████╔╝█████╗  ██████╔╝██║   ██║',
  '  ██╔══██╗██╔══╝  ██╔═══╝ ██║   ██║',
  '  ██║  ██║███████╗██║     ╚██████╔╝',
  '  ╚═╝  ╚═╝╚══════╝╚═╝      ╚═════╝ ',
]

export function showBanner(version: string): void {
  console.log()
  LINE1.forEach((l) => console.log(pc.cyan(l)))
  console.log()
  LINE2.forEach((l) => console.log(pc.magenta(l)))
  console.log()
  console.log(
    `  ${pc.dim('v' + version)}` +
    pc.dim('  ·  ') +
    pc.dim('by Luminescence Dev'),
  )
  console.log()
}
